INSERT INTO tbl_department(department_name)
    VALUES('내과'),
    ('외과'),
    ('안과'),
    ('이비인후과'),
    ('치과'),
    ('심리치료학과'),
    ('피부과');


INSERT INTO tbl_doctor(doctor_name, doctor_gender, doctor_phone, doctor_email, rank_code, department_code)
VALUES
    ('김닥터', '남', '010-1234-5678', 'kim_doc@naver.com', 1, 2),
    ('이닥터', '여', '010-5555-5555', 'lee_doc@naver.com', 2, 1),
    ('박닥터', '여', '010-9999-9999', 'park_doc@naver.com', 3, 3),
    ('최닥터', '남', '010-1111-1111', 'choi_doc@naver.com', 4, 4),
    ('정닥터', '남', '010-7777-7777', 'jung_doc@naver.com', 5, 5),
    ('강닥터', '여', '010-8888-8888', 'kang_doc2@naver.com', 1, 7),
    ('조닥터', '여', '010-6666-6666', 'jo_doc2@naver.com', 2, 6),
    ('윤닥터', '남', '010-2222-2222', 'yun_doc2@naver.com', 3, 5),
    ('장닥터', '남', '010-3333-3333', 'jang_doc2@naver.com', 4, 2),
    ('임닥터', '남', '010-4444-4444', 'lim_doc2@naver.com', 5, 4),
    ('한닥터', '여', '010-1212-1212', 'han_doc2@naver.com', 1, 3),
    ('오닥터', '남', '010-1313-1313', 'oh_doc2@naver.com', 2, 2),
    ('서닥터', '여', '010-1414-1414', 'seo_doc2@naver.com', 3, 1),
    ('신닥터', '남', '010-1515-1515', 'shin_doc2@naver.com', 4, 6),
    ('권닥터', '여', '010-1616-1616', 'gwan_doc2@naver.com', 5, 7),
    ('황닥터', '여', '010-1717-1717', 'hwang_doc2@naver.com', 1, 5),
    ('안닥터', '남', '010-1818-1818', 'an_doc2@naver.com', 2, 4),
    ('송닥터', '남', '010-1919-1919', 'song_doc2@naver.com', 3, 3),
    ('전닥터', '여', '010-2020-2020', 'jun_doc2@naver.com', 4, 2),
    ('고닥터', '여', '010-2121-2121', 'ko_doc2@naver.com', 5, 1);



INSERT INTO tbl_medical_history(medical_history_detail,medical_history_price,medical_history_ispay,medical_history_datetime,medical_history_runtime,patient_code,doctor_code)
    VALUES('진료기록1',3500,'Y','2023-02-07 14:22',10,1,3),
    ('진료기록2', 5000, 'N', '2023-02-08 09:45', 15, 2, 2),
    ('진료기록3', 4500, 'Y', '2023-02-09 11:30', 12, 3, 1),
    ('진료기록4', 3000, 'Y', '2023-02-10 16:55', 8, 4, 4),
    ('진료기록5', 4000, 'N', '2023-02-11 13:10', 11, 5, 8),
    ('진료기록6', 5500, 'Y', '2023-02-12 10:20', 14, 6, 9),
    ('진료기록7', 3200, 'Y', '2023-02-13 15:40', 9, 7, 3),
    ('진료기록8', 4800, 'N', '2023-02-14 12:15', 13, 8, 6),
    ('진료기록9', 3700, 'Y', '2023-02-15 08:30', 16, 9, 7),
    ('진료기록10', 4200, 'Y', '2023-02-16 17:05', 7, 10, 10),
    ('진료기록11', 3900, 'N', '2023-02-17 16:40', 10, 1, 13),
    ('진료기록12', 5300, 'Y', '2023-02-18 14:55', 11, 2, 12),
    ('진료기록13', 3600, 'Y', '2023-02-19 09:20', 15, 3, 18),
    ('진료기록14', 4100, 'N', '2023-02-20 11:45', 12, 4, 19),
    ('진료기록15', 4900, 'Y', '2023-02-21 16:10', 9, 5, 17),
    ('진료기록16', 3400, 'Y', '2023-02-22 13:35', 14, 6, 16),
    ('진료기록17', 5200, 'N', '2023-02-23 15:00', 10, 7, 12),
    ('진료기록18', 4300, 'Y', '2023-02-24 12:25', 13, 8, 5),
    ('진료기록19', 3800, 'Y', '2023-02-25 08:50', 16, 9, 3),
    ('진료기록20', 4700, 'N', '2023-02-26 17:15', 7, 10, 11);


INSERT INTO tbl_patient(patient_name,patient_age,patient_gender,patient_phone,patient_email,patient_sick,patient_admission,department_code)
    VALUES('손환자',65,'남','010-2323-2323','son_patient@naver.com','감기','N',1),
    ('유환자',9,'남','010-2424-2424','yu_patient@naver.com','골절','Y',2),
    ('양환자',15,'여','010-2525-2525','yang_patient@naver.com','시력검사','N',3),
    ('배환자',34,'여','010-2626-2626','bae_patient@naver.com','코막힘','N',4),
    ('성환자',46,'남','010-2727-2727','sung_patient@naver.com','충치','N',5),
    ('차환자',78,'여','010-2828-2828','cha_patient@naver.com','스트레스','Y',6),
    ('주환자',55,'여','010-2992-2992','ju_patient@naver.com','여드름','N',7),
    ('곽환자',24,'남','010-3030-3030','gwak_patient@naver.com','소화불량','Y',1),
    ('구환자',28,'남','010-3131-3131','gu_patient@naver.com','상처','Y',2),
    ('류환자',35,'여','010-3232-3232','ryu_patient@naver.com','안구충돌','Y',3),
    ('진환자',48,'남','010-3434-3434','jin_patient@naver.com','코피','N',4),
    ('지환자',63,'남','010-3535-3535','ji_patient@naver.com','바이러스감염','Y',5),
    ('하환자',25,'여','010-3636-3636','ha_patient@naver.com','우울증','Y',6),
    ('성환자',20,'남','010-3737-3737','sung_patient@naver.com','습진','N',7),
    ('허환자',30,'남','010-3838-3838','heu_patient@naver.com','고혈압','Y',1),
    ('백환자',8,'여','010-3939-3939','baek_patient@naver.com','수술 후 통증','Y',2),
    ('남환자',18,'남','010-4040-4040','nam_patient@naver.com','안과검진','N',3),
    ('송환자',12,'남','010-4141-4141','song_patient@naver.com','귓병','Y',4),
    ('문환자',15,'여','010-4242-4242','mun_patient@naver.com','맹출','N',5),
    ('박환자',59,'남','010-4343-4343','park_patient@naver.com','불안장애','Y',6),
    ('이환자',36,'여','010-4545-4545','lee_patient@naver.com','사마귀','N',7)
    ;


INSERT INTO tbl_rank(rank_name)
    VALUES('교수'),
    ('펠로우'),
    ('레지던트'),
    ('인턴'),
    ('실습생');